app/views/binnacles/new.html.erb

		    <label for="text">Nombre:</label>
		    <%= f.collection_select(:nombre_student, Student.all,:nombre, :nombre, :class => 'form-control') %>
---
SELECT "students".* FROM "students" WHERE (telefono = 0)

		    <label for="text">Nombre Equipo:</label>
        <%= f.collection_select(:nombre_computer, Computer.all,:equipo, :equipo, :class => 'form-control') %>
---
SELECT "computers".* FROM "computers" WHERE (idi = '0')