app/controllers/binnacles_controller.rb

SELECT "binnacles".* FROM "binnacles" WHERE (horafinal = 'ocupado' , nombre_student='Miguel  Angel ')
SELECT "binnacles".* FROM "binnacles" WHERE "binnacles"."horafinal" = $1 AND "binnacles"."nombre_student" = $2  [["horafinal", "ocupado"], ["nombre_student", "Miguel  Angel "]]
SELECT "binnacles".* FROM "binnacles"
SELECT COUNT(*) FROM "binnacles" WHERE "binnacles"."horafinal" = $1 AND "binnacles"."nombre_student" = $2  [["horafinal", "ocupado"], ["nombre_student", "Miguel  Angel "]]
---
  def index
    @activos = Binnacle.where("horafinal = ?", "ocupado")
    @binnacles = Binnacle.where(horafinal: 'ocupado', nombre_student:session[:current_alumno_id])
    @historial = Binnacle.all
    @longitud = Binnacle.where(horafinal: 'ocupado', nombre_student:session[:current_alumno_id]).count

SELECT  "binnacles".* FROM "binnacles" WHERE "binnacles"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
    @binnacle = Binnacle.find(params[:id])

SELECT "students".* FROM "students" WHERE (telefono = 0)
---
	def new
	   @binnacle = Binnacle.new
     @students = Student.all

INSERT INTO "binnacles" ("nombre_student", "horainicial", "horafinal", "nombre_computer", "tiempo", "fecha", "observaciones", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT  "computers".* FROM "computers" WHERE "computers"."equipo" = $1 LIMIT 1  [["equipo", "Maquina1"]]
UPDATE "computers" SET "idi" = $1, "updated_at" = $2 WHERE "computers"."id" = $3  [["idi", 1], ["updated_at", "2016-06-30 18:57:52.160450"], ["id", 2]]
SELECT  "students".* FROM "students" WHERE "students"."nombre" = $1 LIMIT 1  [["nombre", "Miguel Angel"]]
UPDATE "students" SET "telefono" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["telefono", "1"], ["updated_at", "2016-06-30 18:57:52.191987"], ["id", 4]]
---
	def create
    fechageneral = Time.new
		@binnacle = Binnacle.new(nombre_student: params[:binnacle][:nombre_student] ,
							                 horainicial: fechageneral.strftime("%H:%M"),
                               horafinal: 'ocupado',
                               nombre_computer: params[:binnacle][:nombre_computer],
                               tiempo: '',
                               fecha: fechageneral.strftime("%d/%m/%Y"),
                               observaciones:'Sin observaciones')
		if @binnacle.save
      session[:current_alumno_id] = @binnacle.nombre_student

      @computerA = Computer.find_by(equipo: params[:binnacle][:nombre_computer])
      @computerA.update(idi:'1')


      @studentB = Student.find_by(nombre: params[:binnacle][:nombre_student])
      @studentB.update(telefono:'1')

SELECT  "binnacles".* FROM "binnacles" WHERE "binnacles"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "computers".* FROM "computers" WHERE "computers"."equipo" = $1 LIMIT 1  [["equipo", "Miguel  Angel "]]
UPDATE "binnacles" SET "horafinal" = $1, "tiempo" = $2, "updated_at" = $3 WHERE "binnacles"."id" = $4  [["horafinal", "11:11"], ["tiempo", "11:11"], ["updated_at", "2016-06-30 16:11:59.903264"], ["id", 1]]
UPDATE "computers" SET "idi" = $1, "updated_at" = $2 WHERE "computers"."id" = $3  [["idi", 0], ["updated_at", "2016-06-30 19:00:22.139414"], ["id", 3]]
SELECT  "students".* FROM "students" WHERE "students"."nombre" = $1 LIMIT 1  [["nombre", "Nasheli"]]
UPDATE "students" SET "telefono" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["telefono", "0"], ["updated_at", "2016-06-30 19:00:22.254382"], ["id", 6]]
---
	def edit
    fechageneral = Time.new
  	@binnacle = Binnacle.find(params[:id])
    fechaanterio = (@binnacle.horafinal).split(':')

    tiempoH =  fechageneral.strftime("%H").to_i - fechaanterio[0].to_i
    tiempoM =  fechageneral.strftime("%M").to_i - fechaanterio[1].to_i
    tiempoH = tiempoH.to_s
    tiempoM = tiempoM.to_s
    #tiemporeal = tiempoH.to_s +":"
     #( Integer(fechageneral.strftime("%H"))-Integer(fechaanterio[0]) )
    #( Integer(fechageneral.strftime("%M"))-Integer(fechaanterio[1]) )

    @computerA = Computer.find_by(equipo:@binnacle.nombre_computer)
    @computerA.update(idi:'0')


    @studentB = Student.find_by(nombre: @binnacle.nombre_student)
    @studentB.update(telefono:'0')