app/controllers/complains_controller.rb

  def index
    @complains = Complain.all
---
SELECT "complains".* FROM "complains"

  def create
    @complain = Complain.new(complain_params)

    respond_to do |format|
      if @complain.save
---
INSERT INTO "complains" ("name", "phone", "email", "subject", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Miguel"], ["phone", "iojio"], ["email", "iojioj"], ["subject", "iojio"], ["content", "jiojio"], ["created_at", "2016-06-30 19:03:09.512445"], ["updated_at", "2016-06-30 19:03:09.512445"]]

  def destroy
    @complain.destroy
---
DELETE FROM "complains" WHERE "complains"."id" = $1  [["id", 980190962]]

    def set_complain
      @complain = Complain.find(params[:id])
---
SELECT  "complains".* FROM "complains" WHERE "complains"."id" = $1 LIMIT 1  [["id", 980190962]]