app/controllers/computers_controller.rb

SELECT "computers".* FROM "computers"
---
  def index
    @computers = Computer.all

SELECT  "computers".* FROM "computers" WHERE "computers"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
    @computer = Computer.find(params[:id])

INSERT INTO "computers" ("equipo", "idi", "numserie", "marca", "tipo", "modelo", "observaciones", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
	def create
		@computer = Computer.new(equipo: params[:computer][:equipo] ,
							                 idi: "0",
                               numserie: params[:computer][:numserie],
                               marca: params[:computer][:marca],
                               tipo: params[:computer][:tipo],
                               modelo: params[:computer][:modelo],
                               observaciones: params[:computer][:observaciones])
		if @computer.save

SELECT  "computers".* FROM "computers" WHERE "computers"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "computers" WHERE "computers"."id" = $1  [["id", 1]]
---
	def destroy
  	@computer = Computer.find(params[:id])
		@computer.destroy #Elimina el objeto de la bd