app/controllers/messages_controller.rb

INSERT INTO "messages" ("name", "email", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Miguel"], ["email", "huhiuhui"], ["content", "hiuhuih"], ["created_at", "2016-06-30 19:02:52.897957"], ["updated_at", "2016-06-30 19:02:52.897957"]]
---
  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save