app/controllers/programs_controller.rb

  def index
    @programs = Program.all
---
SELECT "programs".* FROM "programs"

  def new
    @program = Program.new
    @computers  = Computer.all
---
SELECT "computers".* FROM "computers"

  def create
    @program = Program.new(program_params)
    @program.computers = params[:computers]
    respond_to do |format|
      if @program.save
---
INSERT INTO "has_computers" ("computer_id", "program_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["computer_id", 4], ["program_id", 1], ["created_at", "2016-06-30 19:18:24.177570"], ["updated_at", "2016-06-30 19:18:24.177570"]]
INSERT INTO "programs" ("nombre", "version", "plataforma", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nombre", "Windows 8"], ["version", "777"], ["plataforma", "Software Libre"], ["created_at", "2016-06-30 19:18:23.970075"], ["updated_at", "2016-06-30 19:18:23.970075"]]

    def set_program
      @program = Program.find(params[:id])
---
SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT 1  [["id", 1]]