app/controllers/students_controller.rb

INSERT INTO "students" ("nombre", "app", "apm", "estado", "municipio", "direccion", "telefono", "celular", "correo", "matricula", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
	def create
		@student = Student.new(nombre: params[:student][:nombre] ,
							                 app: params[:student][:app],
                               apm: params[:student][:apm],
                               estado: params[:student][:estado],
                               municipio: params[:student][:municipio],
                               direccion: params[:student][:direccion],
                               telefono: params[:student][:telefono],
                               celular: params[:student][:celular],
                               correo: params[:student][:correo],
                               matricula: params[:student][:matricula])
		if @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 1]]
---
	def destroy
  	@student = Student.find(params[:id])
		@student.destroy #Elimina el objeto de la bd