app/controllers/tests_controller.rb

  def create
    @test = Test.new(test_params)

    respond_to do |format|
      if @test.save
---
INSERT INTO "tests" ("p1", "p2", "p3", "p4", "p5", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["p1", "MyString"], ["p2", "MyString"], ["p3", "MyString"], ["p4", "MyString"], ["p5", "MyText"], ["created_at", "2016-06-30 14:20:49.641762"], ["updated_at", "2016-06-30 14:20:49.641762"]]

  def destroy
    @test.destroy
---
DELETE FROM "tests" WHERE "tests"."id" = $1  [["id", 980190962]]